app/controllers/helprequests_controller.rb

SELECT "helprequests".* FROM "helprequests"
---
  def index
    @helprequests = Helprequest.all

INSERT INTO "helprequests" ("subject", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["subject", "Test Complaint"], ["content", "just testing the complaint"], ["created_at", "2017-12-09 06:20:19.444251"], ["updated_at", "2017-12-09 06:20:19.444251"]]
---
  def create
    @helprequest = Helprequest.new(helprequest_params)

    respond_to do |format|
      if @helprequest.save

SELECT  "helprequests".* FROM "helprequests" WHERE "helprequests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_helprequest
      @helprequest = Helprequest.find(params[:id])