app/controllers/schedules_controller.rb

  def display
    @schedules = Schedule.search(params[:search]).order("created_at DESC")
---
SELECT "schedules".* FROM "schedules" WHERE (team1 Like '%buffalo%' OR team2 Like '%buffalo') ORDER BY created_at DESC

  def create
    @schedule = Schedule.new(schedule_params)

    respond_to do |format|
      if @schedule.save
---
INSERT INTO "schedules" ("team1", "team2", "location", "date", "time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @schedule.update(schedule_params)
---
UPDATE "schedules" SET "time" = ?, "updated_at" = ? WHERE "schedules"."id" = ?  [["time", "2000-01-01 12:44:00"], ["updated_at", "2017-12-10 11:44:50.806350"], ["id", 4]]