app/controllers/stats_controller.rb

  def index
    @stats = Stat.all
---
SELECT "stats".* FROM "stats"

  def display
    @stats = Stat.search(params[:search]).order("created_at DESC")
---
SELECT "stats".* FROM "stats" WHERE (playername Like '%steven%') ORDER BY created_at DESC

  def create
    @stat = Stat.new(stat_params)

    respond_to do |format|
      if @stat.save
---
INSERT INTO "stats" ("playername", "team", "position", "goals", "assists", "points", "penaltymin", "shots", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_stat
      @stat = Stat.find(params[:id])
---
SELECT  "stats".* FROM "stats" WHERE "stats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]